notes/6--A-typed-lambda-calculus-TL.org
#+Title: A typed λ-calculus, /TL/
#+Subtitle: Principles of Programming Languages
#+Author: Mark Armstrong
#+Date: Fall 2020
#+Description: Extending our lambda calculus with type checking (enforcement).
#+Options: toc:nil

* HTML settings                                 :noexport:

** Reveal settings

#+Reveal_root: ./reveal.js
#+Reveal_init_options: width:1600, height:900, controlsLayout:'edges',
#+Reveal_init_options: margin: 0.1, minScale:0.125, maxScale:5,
#+Reveal_init_options: mouseWheel: true
#+Reveal_extra_css: local.css

# #+HTML: <script src="https://cdnjs.cloudflare.com/ajax/libs/headjs/0.96/head.min.js"></script>

* LaTeX settings                                :noexport:

#+LaTeX_header: \usepackage{amsthm}
#+LaTeX_header: \theoremstyle{definition}
#+LaTeX_header: \newtheorem{definition}{Definition}[section]

#+LaTeX_header: \usepackage{unicode-math}
#+LaTeX_header: \usepackage{unicode}

* Preamble

** Notable references

- Benjamin Pierce,
  “[[https://ebookcentral.proquest.com/lib/mcmu/detail.action?docID=3338823][Types and Programming Languages]]”
  - Chapter 9, Simply Typed Lambda-Calculus
    - Function types, the typing relation
  - Chapter 11, Simple Extensions
    - Unit, Tuples, Sums, Variants, Lists.

** TODO Table of contents

# The table of contents are added using org-reveal-manual-toc,
# and so must be updated upon changes or added last.
# Note that hidden headings are included, and so must be deleted!

#+HTML: <font size="-1">
#+begin_scriptsize
  - [[Preamble][Preamble]]
#+end_scriptsize
#+HTML: </font>

* Introduction

In this section we extend our previously considered
untyped λ-calculus by defining a typing relation,
essentially adding type checking (enforcement).

We then investigate adding some
algebraic type formers to the language.
This involves the introduction of a rudimentary form
of pattern matching.

* Recall: The untyped λ-calculus

** Preamble                                    :ignore:

Recall from section 3 of the notes the syntax
of our untyped λ-calculus, /UL/.
#+begin_src text
⟨term⟩ ∷= var | λ var → ⟨term⟩ | ⟨term⟩ ⟨term⟩
#+end_src

Recall that in this pure untyped λ-calculus,
everything is a function, and abstractions
(terms of the form ~λ x → t~) are /values/.

** The call-by-value semantics of the untyped λ-calculus

The call-by-value semantics we described in section 3 of the notes
can be more succinctly described using inference rules.
- In fact, we only need three rules.

- Here the arrow ~⟶~ defines a /reduction/ relation,
  meaning that we may need to perform several ~⟶~ “steps” to fully
  evaluate a term.
- The (meta)variables ~t₁~, ~t₂~, etc., range over λ-terms, and
- the (meta)variables ~v₁~, ~v₂~, etc., range over λ-terms /which are values/.
#+begin_src text
  t₁  ⟶  t₁′
––––––––––––––––––– reduce-appˡ
 t₁ t₂  ⟶  t₁′ t₂

 
  t₂  ⟶  t₂′
––––––––––––––––––– reduce-Appʳ
 v₁ t₂  ⟶  v₁ t₂′


–––––––––––––––––––––––––––––– apply
(λ x → t) v  ⟶  t[x ≔ v]
#+end_src

** Only applications reduce

@@latex:\iffalse@@
#+begin_src text
  t₁  ⟶  t₁′                             t₂  ⟶  t₂′                   
––––––––––––––––––– reduce-appˡ        ––––––––––––––––––– reduce-Appʳ
 t₁ t₂  ⟶  t₁′ t₂                       v₁ t₂  ⟶  v₁ t₂′              


 
             –––––––––––––––––––––––––––––– apply
             (λ x → t) v  ⟶  t[x ≔ v]
#+end_src
@@latex:\fi@@

Notice, in the above semantics, that the only rules
are for applications; remember that
- variables cannot be reduced, and
- under call-by-value semantics,
  - no evaluations take place inside abstractions, and
  - abstractions are only applied to values.

