notes/6--A-typed-lambda-calculus-TL.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>A typed λ-calculus, <i>TL</i></title>
<meta name="author" content="(Mark Armstrong)"/>
<meta name="description" content="Extending our lambda calculus with type checking (enforcement)."/>
<link rel="stylesheet" href="./reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/dist/theme/black.css" id="theme"/>

<link rel="stylesheet" href="local.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h2 class="title">A typed λ-calculus, <i>TL</i></h2>
   <h3>Principles of Programming Languages</h3>
   <h4>Mark Armstrong</h4>
   <h5>Fall 2020</h5>
</section>

<section>
<section id="slide-org149d701">
<h2 id="org149d701"><span class="section-number-2">1</span> Preamble</h2>
<div class="outline-text-2" id="text-1">
</div>
</section>
<section id="slide-org044f17d">
<h3 id="org044f17d"><span class="section-number-3">1.1</span> Notable references</h3>
<ul>
<li>Benjamin Pierce,
“<a href="https://ebookcentral.proquest.com/lib/mcmu/detail.action?docID=3338823">Types and Programming Languages</a>”
<ul>
<li>Chapter 9, Simply Typed Lambda-Calculus
<ul>
<li>Function types, the typing relation</li>

</ul></li>
<li>Chapter 11, Simple Extensions
<ul>
<li>Unit, Tuples, Sums, Variants, Lists.</li>

</ul></li>

</ul></li>

</ul>

</section>
<section id="slide-org81f7a4e">
<h3 id="org81f7a4e"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> Table of contents</h3>
<font size="-1">
<div class="scriptsize" id="org0509e5e">
<ul>
<li><a href="#/slide-org149d701">Preamble</a></li>

</ul>

</div>
</font>

</section>
</section>
<section>
<section id="slide-orgaf909dc">
<h2 id="orgaf909dc"><span class="section-number-2">2</span> Introduction</h2>
<p>
In this section we extend our previously considered
untyped λ-calculus by defining a typing relation,
essentially adding type checking (enforcement).
</p>

<p>
We then investigate adding some
algebraic type formers to the language.
This involves the introduction of a rudimentary form
of pattern matching.
</p>

</section>
</section>
<section>
<section id="slide-org752bb80">
<h2 id="org752bb80"><span class="section-number-2">3</span> Recall: The untyped λ-calculus</h2>
<p>
Recall from section 3 of the notes the syntax
of our untyped λ-calculus, <i>UL</i>.
</p>
<div class="org-src-container">

<pre  class="src src-text"><code trim><span style="color: #00cd68;">&#10216;</span>term<span style="color: #00cd68;">&#10217;</span> &#8759;= var | &#955; var &#8594; <span style="color: #00cd68;">&#10216;</span>term<span style="color: #00cd68;">&#10217;</span> | <span style="color: #00cd68;">&#10216;</span>term<span style="color: #00cd68;">&#10217;</span> <span style="color: #00cd68;">&#10216;</span>term<span style="color: #00cd68;">&#10217;</span>
</code></pre>
</div>

<p>
Recall that in this pure untyped λ-calculus,
everything is a function, and abstractions
(terms of the form <code>λ x → t</code>) are <i>values</i>.
</p>

</section>
<section id="slide-orgc1a1000">
<h3 id="orgc1a1000"><span class="section-number-3">3.1</span> The call-by-value semantics of the untyped λ-calculus</h3>
<p>
The call-by-value semantics we described in section 3 of the notes
can be more succinctly described using inference rules.
</p>
<ul>
<li>In fact, we only need three rules.</li>

<li>Here the arrow <code>⟶</code> defines a <i>reduction</i> relation,
meaning that we may need to perform several <code>⟶</code> “steps” to fully
evaluate a term.</li>
<li>The (meta)variables <code>t₁</code>, <code>t₂</code>, etc., range over λ-terms, and</li>
<li>the (meta)variables <code>v₁</code>, <code>v₂</code>, etc., range over λ-terms <i>which are values</i>.</li>

</ul>
<div class="org-src-container">

<pre  class="src src-text"><code trim>  t&#8321;  &#10230;  t&#8321;&#8242;
&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; reduce-app&#737;
 t&#8321; t&#8322;  &#10230;  t&#8321;&#8242; t&#8322;

 
  t&#8322;  &#10230;  t&#8322;&#8242;
&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; reduce-App&#691;
 v&#8321; t&#8322;  &#10230;  v&#8321; t&#8322;&#8242;


&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; apply
<span style="color: #00cd68;">(</span>&#955; x &#8594; t<span style="color: #00cd68;">)</span> v  &#10230;  t<span style="color: #00cd68;">[</span>x &#8788; v<span style="color: #00cd68;">]</span>
</code></pre>
</div>

</section>
<section id="slide-org90967b0">
<h3 id="org90967b0"><span class="section-number-3">3.2</span> Only applications reduce</h3>
<p>

</p>
<div class="org-src-container">

<pre  class="src src-text"><code trim>  t&#8321;  &#10230;  t&#8321;&#8242;                             t&#8322;  &#10230;  t&#8322;&#8242;                   
&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; reduce-app&#737;        &#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; reduce-App&#691;
 t&#8321; t&#8322;  &#10230;  t&#8321;&#8242; t&#8322;                       v&#8321; t&#8322;  &#10230;  v&#8321; t&#8322;&#8242;              


 
             &#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; apply
             <span style="color: #00cd68;">(</span>&#955; x &#8594; t<span style="color: #00cd68;">)</span> v  &#10230;  t<span style="color: #00cd68;">[</span>x &#8788; v<span style="color: #00cd68;">]</span>
</code></pre>
</div>
<p>

</p>

<p>
Notice, in the above semantics, that the only rules
are for applications; remember that
</p>
<ul>
<li>variables cannot be reduced, and</li>
<li>under call-by-value semantics,
<ul>
<li>no evaluations take place inside abstractions, and</li>
<li>abstractions are only applied to values.</li>

</ul></li>

</ul>

</section>
