notes/6--A-typed-lambda-calculus-TL.tex
% Created 2020-11-09 Mon 11:22
% Intended LaTeX compiler: lualatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{tabularx}
\usepackage{etoolbox}
\makeatletter
\def\dontdofcolorbox{\renewcommand\fcolorbox[4][]{##4}}
\AtBeginEnvironment{minted}{\dontdofcolorbox}
\makeatother
\usepackage[newfloat]{minted}
\usepackage{amsthm}
\theoremstyle{definition}
\newtheorem{definition}{Definition}[section]
\usepackage{unicode-math}
\usepackage{unicode}
\author{Mark Armstrong}
\date{Fall 2020}
\title{A typed λ-calculus, \emph{TL}\\\medskip
\large Principles of Programming Languages}
\hypersetup{
   pdfauthor={Mark Armstrong},
   pdftitle={A typed λ-calculus, \emph{TL}},
   pdfkeywords={},
   pdfsubject={Extending our lambda calculus with type checking (enforcement).},
   pdfcreator={Emacs 27.0.91 (Org mode 9.4)},
   pdflang={English},
   colorlinks,
   linkcolor=blue,
   citecolor=blue,
   urlcolor=blue
   }
\begin{document}

\maketitle

\section{Preamble}
\label{sec:orgf04e6a5}

\subsection{Notable references}
\label{sec:org0f80e78}

\begin{itemize}
\item Benjamin Pierce,
“\href{https://ebookcentral.proquest.com/lib/mcmu/detail.action?docID=3338823}{Types and Programming Languages}”
\begin{itemize}
\item Chapter 9, Simply Typed Lambda-Calculus
\begin{itemize}
\item Function types, the typing relation
\end{itemize}
\item Chapter 11, Simple Extensions
\begin{itemize}
\item Unit, Tuples, Sums, Variants, Lists.
\end{itemize}
\end{itemize}
\end{itemize}

\subsection{{\bfseries\sffamily TODO} Table of contents}
\label{sec:org12e2d77}

\begin{scriptsize}
\begin{itemize}
\item \hyperref[sec:orgf04e6a5]{Preamble}
\end{itemize}
\end{scriptsize}

\section{Introduction}
\label{sec:org33744d9}

In this section we extend our previously considered
untyped λ-calculus by defining a typing relation,
essentially adding type checking (enforcement).

We then investigate adding some
algebraic type formers to the language.
This involves the introduction of a rudimentary form
of pattern matching.

\section{Recall: The untyped λ-calculus}
\label{sec:org611891e}

Recall from section 3 of the notes the syntax
of our untyped λ-calculus, \emph{UL}.
\begin{minted}[breaklines=true]{text}
⟨term⟩ ∷= var | λ var → ⟨term⟩ | ⟨term⟩ ⟨term⟩
\end{minted}

Recall that in this pure untyped λ-calculus,
everything is a function, and abstractions
(terms of the form \texttt{λ x → t}) are \emph{values}.

\subsection{The call-by-value semantics of the untyped λ-calculus}
\label{sec:org8344f43}

The call-by-value semantics we described in section 3 of the notes
can be more succinctly described using inference rules.
\begin{itemize}
\item In fact, we only need three rules.

\item Here the arrow \texttt{⟶} defines a \emph{reduction} relation,
meaning that we may need to perform several \texttt{⟶} “steps” to fully
evaluate a term.
\item The (meta)variables \texttt{t₁}, \texttt{t₂}, etc., range over λ-terms, and
\item the (meta)variables \texttt{v₁}, \texttt{v₂}, etc., range over λ-terms \emph{which are values}.
\end{itemize}
\begin{minted}[breaklines=true]{text}
  t₁  ⟶  t₁′
––––––––––––––––––– reduce-appˡ
 t₁ t₂  ⟶  t₁′ t₂

 
  t₂  ⟶  t₂′
––––––––––––––––––– reduce-Appʳ
 v₁ t₂  ⟶  v₁ t₂′


–––––––––––––––––––––––––––––– apply
(λ x → t) v  ⟶  t[x ≔ v]
\end{minted}

\subsection{Only applications reduce}
\label{sec:org9da3ba7}

\iffalse
\begin{minted}[breaklines=true]{text}
  t₁  ⟶  t₁′                             t₂  ⟶  t₂′                   
––––––––––––––––––– reduce-appˡ        ––––––––––––––––––– reduce-Appʳ
 t₁ t₂  ⟶  t₁′ t₂                       v₁ t₂  ⟶  v₁ t₂′              


 
             –––––––––––––––––––––––––––––– apply
             (λ x → t) v  ⟶  t[x ≔ v]
\end{minted}
\fi

Notice, in the above semantics, that the only rules
are for applications; remember that
\begin{itemize}
\item variables cannot be reduced, and
\item under call-by-value semantics,
\begin{itemize}
\item no evaluations take place inside abstractions, and
\item abstractions are only applied to values.
\end{itemize}
\end{itemize}
