notes/6--A-typed-lambda-calculus-TL.org
** Explaining the rules

@@latex:\iffalse@@
#+begin_src text
  t₁  ⟶  t₁′                             t₂  ⟶  t₂′                   
––––––––––––––––––– reduce-appˡ        ––––––––––––––––––– reduce-Appʳ
 t₁ t₂  ⟶  t₁′ t₂                       v₁ t₂  ⟶  v₁ t₂′              


 
             –––––––––––––––––––––––––––––– apply
             (λ x → t) v  ⟶  t[x ≔ v]
#+end_src
@@latex:\fi@@

By using our naming conventions, we can see that
- the ~reduce-appˡ~ rule says that
  if ~t₁~ is the left side of an application
  and ~t₁~ reduces to ~t₁′~, then the whole application reduces
  by replacing ~t₁~ with ~t₁′~,
- the ~reduce-appʳ~ rule says that
  if ~t₁~ is the right side of
  an application /whose left side is a value/,
  and ~t₂~ reduces to ~t₂′~, then the whole application reduces
  by replacing ~t₂~ with ~t₂′~, and
- the ~apply~ rule says that if the left side of an application
  is an abstraction, and the right side is a value,
  then the application reduces to the body of the abstraction
  with the value substituted for the abstraction's variable.
  
** Reduction as a function

@@latex:\iffalse@@
#+begin_src text
  t₁  ⟶  t₁′                             t₂  ⟶  t₂′                   
––––––––––––––––––– reduce-appˡ        ––––––––––––––––––– reduce-Appʳ
 t₁ t₂  ⟶  t₁′ t₂                       v₁ t₂  ⟶  v₁ t₂′              


 
             –––––––––––––––––––––––––––––– apply
             (λ x → t) v  ⟶  t[x ≔ v]
#+end_src
@@latex:\fi@@

It bears noting that the /reduction relation/ here is,
by design, /deterministic/; given a λ-term ~t~, either
- ~t~ can be reduced by exactly /one/ of the rules above, or
- ~t~ cannot be reduced (is irreducible) (by these semantics.)

A deterministic relation can be expressed as a /function/,
as the following Scala-like pseudocode shows.
#+begin_example amm
def ⟶(t) = t match {
  case t₁ t₂ if t₁ ⟶ t₁′                 => t₁′ t₂
  case v₁ t₂ if isValue(v₁) &&  t₂ ⟶ t₂′ => v₁ t₂′
  case (λ x → t) v if isValue(v)         => t[x ≔ v]
} 
#+end_example

** An example of a reduction sequence

#+begin_src text
  ((λ x → x) (λ y → y)) ((λ z → z) (λ u → u))
⟶⟨ reduce-appˡ ⟩
  (λ y → y) ((λ z → z) (λ u → u))
⟶⟨ reduce-appʳ ⟩
  (λ y → y) (λ u → u)
⟶⟨ apply ⟩
  λ u → u
#+end_src
The final term does not reduce.

Note that we can end with terms which do not reduce, but which
are not values, such as
#+begin_src text
(λ x → x) y
#+end_src
Since free variables are not values (they are not λ-abstractions),
this term does not fit any of the reduction rules.

** Encodings of booleans, natural numbers and pairs

Recall the λ-encodings discussed in notes section 3,
which allow us to represent booleans, natural numbers
and pairs in the pure untyped λ-calculus.
#+begin_src text
tru  = λ t → λ f → t
fls  = λ t → λ f → f
test = λ l → λ m → λ n → l m n
pair = λ f → λ s → λ b → b f s
fst  = λ p → p tru
snd  = λ p → p fls
zero = λ s → λ z → z
scc  = λ n → λ s → λ z → s (n s z)
#+end_src

