notes/6--A-typed-lambda-calculus-TL.html
<section id="slide-orgea4ae28">
<h3 id="orgea4ae28"><span class="section-number-3">3.3</span> Explaining the rules</h3>
<p>

</p>
<div class="org-src-container">

<pre  class="src src-text"><code trim>  t&#8321;  &#10230;  t&#8321;&#8242;                             t&#8322;  &#10230;  t&#8322;&#8242;                   
&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; reduce-app&#737;        &#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; reduce-App&#691;
 t&#8321; t&#8322;  &#10230;  t&#8321;&#8242; t&#8322;                       v&#8321; t&#8322;  &#10230;  v&#8321; t&#8322;&#8242;              


 
             &#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; apply
             <span style="color: #00cd68;">(</span>&#955; x &#8594; t<span style="color: #00cd68;">)</span> v  &#10230;  t<span style="color: #00cd68;">[</span>x &#8788; v<span style="color: #00cd68;">]</span>
</code></pre>
</div>
<p>

</p>

<p>
By using our naming conventions, we can see that
</p>
<ul>
<li>the <code>reduce-appˡ</code> rule says that
if <code>t₁</code> is the left side of an application
and <code>t₁</code> reduces to <code>t₁′</code>, then the whole application reduces
by replacing <code>t₁</code> with <code>t₁′</code>,</li>
<li>the <code>reduce-appʳ</code> rule says that
if <code>t₁</code> is the right side of
an application <i>whose left side is a value</i>,
and <code>t₂</code> reduces to <code>t₂′</code>, then the whole application reduces
by replacing <code>t₂</code> with <code>t₂′</code>, and</li>
<li>the <code>apply</code> rule says that if the left side of an application
is an abstraction, and the right side is a value,
then the application reduces to the body of the abstraction
with the value substituted for the abstraction's variable.</li>

</ul>

</section>
<section id="slide-org87039c2">
<h3 id="org87039c2"><span class="section-number-3">3.4</span> Reduction as a function</h3>
<p>

</p>
<div class="org-src-container">

<pre  class="src src-text"><code trim>  t&#8321;  &#10230;  t&#8321;&#8242;                             t&#8322;  &#10230;  t&#8322;&#8242;                   
&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; reduce-app&#737;        &#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; reduce-App&#691;
 t&#8321; t&#8322;  &#10230;  t&#8321;&#8242; t&#8322;                       v&#8321; t&#8322;  &#10230;  v&#8321; t&#8322;&#8242;              


 
             &#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; apply
             <span style="color: #00cd68;">(</span>&#955; x &#8594; t<span style="color: #00cd68;">)</span> v  &#10230;  t<span style="color: #00cd68;">[</span>x &#8788; v<span style="color: #00cd68;">]</span>
</code></pre>
</div>
<p>

</p>

<p>
It bears noting that the <i>reduction relation</i> here is,
by design, <i>deterministic</i>; given a λ-term <code>t</code>, either
</p>
<ul>
<li><code>t</code> can be reduced by exactly <i>one</i> of the rules above, or</li>
<li><code>t</code> cannot be reduced (is irreducible) (by these semantics.)</li>

</ul>

<p>
A deterministic relation can be expressed as a <i>function</i>,
as the following Scala-like pseudocode shows.
</p>
<pre class="example" id="orgd39854e">
def ⟶(t) = t match {
  case t₁ t₂ if t₁ ⟶ t₁′                 =&gt; t₁′ t₂
  case v₁ t₂ if isValue(v₁) &amp;&amp;  t₂ ⟶ t₂′ =&gt; v₁ t₂′
  case (λ x → t) v if isValue(v)         =&gt; t[x ≔ v]
} 
</pre>

</section>
<section id="slide-orgd97d436">
<h3 id="orgd97d436"><span class="section-number-3">3.5</span> An example of a reduction sequence</h3>
<div class="org-src-container">

<pre  class="src src-text"><code trim>  <span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">(</span>&#955; x &#8594; x<span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">(</span>&#955; y &#8594; y<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span> <span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">(</span>&#955; z &#8594; z<span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">(</span>&#955; u &#8594; u<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
&#10230;<span style="color: #00cd68;">&#10216;</span> reduce-app&#737; <span style="color: #00cd68;">&#10217;</span>
  <span style="color: #00cd68;">(</span>&#955; y &#8594; y<span style="color: #00cd68;">)</span> <span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">(</span>&#955; z &#8594; z<span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">(</span>&#955; u &#8594; u<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
&#10230;<span style="color: #00cd68;">&#10216;</span> reduce-app&#691; <span style="color: #00cd68;">&#10217;</span>
  <span style="color: #00cd68;">(</span>&#955; y &#8594; y<span style="color: #00cd68;">)</span> <span style="color: #00cd68;">(</span>&#955; u &#8594; u<span style="color: #00cd68;">)</span>
&#10230;<span style="color: #00cd68;">&#10216;</span> apply <span style="color: #00cd68;">&#10217;</span>
  &#955; u &#8594; u
</code></pre>
</div>
<p>
The final term does not reduce.
</p>

<p>
Note that we can end with terms which do not reduce, but which
are not values, such as
</p>
<div class="org-src-container">

<pre  class="src src-text"><code trim><span style="color: #00cd68;">(</span>&#955; x &#8594; x<span style="color: #00cd68;">)</span> y
</code></pre>
</div>
<p>
Since free variables are not values (they are not λ-abstractions),
this term does not fit any of the reduction rules.
</p>

</section>
<section id="slide-orga334cef">
<h3 id="orga334cef"><span class="section-number-3">3.6</span> Encodings of booleans, natural numbers and pairs</h3>
<p>
Recall the λ-encodings discussed in notes section 3,
which allow us to represent booleans, natural numbers
and pairs in the pure untyped λ-calculus.
</p>
<div class="org-src-container">

<pre  class="src src-text"><code trim>tru  = &#955; t &#8594; &#955; f &#8594; t
fls  = &#955; t &#8594; &#955; f &#8594; f
test = &#955; l &#8594; &#955; m &#8594; &#955; n &#8594; l m n
pair = &#955; f &#8594; &#955; s &#8594; &#955; b &#8594; b f s
fst  = &#955; p &#8594; p tru
snd  = &#955; p &#8594; p fls
zero = &#955; s &#8594; &#955; z &#8594; z
scc  = &#955; n &#8594; &#955; s &#8594; &#955; z &#8594; s <span style="color: #00cd68;">(</span>n s z<span style="color: #00cd68;">)</span>
</code></pre>
</div>

</section>
