notes/6--A-typed-lambda-calculus-TL.tex

\subsection{Explaining the rules}
\label{sec:org3768f1d}

\iffalse
\begin{minted}[breaklines=true]{text}
  t₁  ⟶  t₁′                             t₂  ⟶  t₂′                   
––––––––––––––––––– reduce-appˡ        ––––––––––––––––––– reduce-Appʳ
 t₁ t₂  ⟶  t₁′ t₂                       v₁ t₂  ⟶  v₁ t₂′              


 
             –––––––––––––––––––––––––––––– apply
             (λ x → t) v  ⟶  t[x ≔ v]
\end{minted}
\fi

By using our naming conventions, we can see that
\begin{itemize}
\item the \texttt{reduce-appˡ} rule says that
if \texttt{t₁} is the left side of an application
and \texttt{t₁} reduces to \texttt{t₁′}, then the whole application reduces
by replacing \texttt{t₁} with \texttt{t₁′},
\item the \texttt{reduce-appʳ} rule says that
if \texttt{t₁} is the right side of
an application \emph{whose left side is a value},
and \texttt{t₂} reduces to \texttt{t₂′}, then the whole application reduces
by replacing \texttt{t₂} with \texttt{t₂′}, and
\item the \texttt{apply} rule says that if the left side of an application
is an abstraction, and the right side is a value,
then the application reduces to the body of the abstraction
with the value substituted for the abstraction's variable.
\end{itemize}

\subsection{Reduction as a function}
\label{sec:org193b251}

\iffalse
\begin{minted}[breaklines=true]{text}
  t₁  ⟶  t₁′                             t₂  ⟶  t₂′                   
––––––––––––––––––– reduce-appˡ        ––––––––––––––––––– reduce-Appʳ
 t₁ t₂  ⟶  t₁′ t₂                       v₁ t₂  ⟶  v₁ t₂′              


 
             –––––––––––––––––––––––––––––– apply
             (λ x → t) v  ⟶  t[x ≔ v]
\end{minted}
\fi

It bears noting that the \emph{reduction relation} here is,
by design, \emph{deterministic}; given a λ-term \texttt{t}, either
\begin{itemize}
\item \texttt{t} can be reduced by exactly \emph{one} of the rules above, or
\item \texttt{t} cannot be reduced (is irreducible) (by these semantics.)
\end{itemize}

A deterministic relation can be expressed as a \emph{function},
as the following Scala-like pseudocode shows.
\begin{verbatim}
def ⟶(t) = t match {
  case t₁ t₂ if t₁ ⟶ t₁′                 => t₁′ t₂
  case v₁ t₂ if isValue(v₁) &&  t₂ ⟶ t₂′ => v₁ t₂′
  case (λ x → t) v if isValue(v)         => t[x ≔ v]
} 
\end{verbatim}

\subsection{An example of a reduction sequence}
\label{sec:org1aa31f0}

\begin{minted}[breaklines=true]{text}
  ((λ x → x) (λ y → y)) ((λ z → z) (λ u → u))
⟶⟨ reduce-appˡ ⟩
  (λ y → y) ((λ z → z) (λ u → u))
⟶⟨ reduce-appʳ ⟩
  (λ y → y) (λ u → u)
⟶⟨ apply ⟩
  λ u → u
\end{minted}
The final term does not reduce.

Note that we can end with terms which do not reduce, but which
are not values, such as
\begin{minted}[breaklines=true]{text}
(λ x → x) y
\end{minted}
Since free variables are not values (they are not λ-abstractions),
this term does not fit any of the reduction rules.

\subsection{Encodings of booleans, natural numbers and pairs}
\label{sec:orgcfafcb2}

Recall the λ-encodings discussed in notes section 3,
which allow us to represent booleans, natural numbers
and pairs in the pure untyped λ-calculus.
\begin{minted}[breaklines=true]{text}
tru  = λ t → λ f → t
fls  = λ t → λ f → f
test = λ l → λ m → λ n → l m n
pair = λ f → λ s → λ b → b f s
fst  = λ p → p tru
snd  = λ p → p fls
zero = λ s → λ z → z
scc  = λ n → λ s → λ z → s (n s z)
\end{minted}
