notes/6--A-typed-lambda-calculus-TL.org
** Enriching the (syntax of the) calculus

While λ-encodings of data in the pure untyped λ-calculus,
such as those for the booleans, natural numbers and pairs,
do allow us to construct programs working on any type data
we might like, it is usually more convenient
(even in this untyped system)
to instead /enrich/ the calculus with new primitive terms
for the types we want to work with.

We will show here how this can be done for booleans.
The enriched calculus's syntax is then
#+begin_src text
⟨term⟩ ∷= var | λ var → ⟨term⟩ | ⟨term⟩ ⟨term⟩
        | true | false
        | if ⟨term⟩ then ⟨term⟩ else ⟨term⟩
#+end_src

** The semantics of the extended calculus

:TODO:

* The simply typed λ-calculus

:TODO:

* “Simple extensions” to the simply typed λ-calculus

:TODO:
