notes/6--A-typed-lambda-calculus-TL.tex

\subsection{Enriching the (syntax of the) calculus}
\label{sec:orgb583b0b}

While λ-encodings of data in the pure untyped λ-calculus,
such as those for the booleans, natural numbers and pairs,
do allow us to construct programs working on any type data
we might like, it is usually more convenient
(even in this untyped system)
to instead \emph{enrich} the calculus with new primitive terms
for the types we want to work with.

We will show here how this can be done for booleans.
The enriched calculus's syntax is then
\begin{minted}[breaklines=true]{text}
⟨term⟩ ∷= var | λ var → ⟨term⟩ | ⟨term⟩ ⟨term⟩
        | true | false
        | if ⟨term⟩ then ⟨term⟩ else ⟨term⟩
\end{minted}

\subsection{The semantics of the extended calculus}
\label{sec:orgca45f25}

:TODO:

\section{The simply typed λ-calculus}
\label{sec:org55bb4cc}

:TODO:

\section{“Simple extensions” to the simply typed λ-calculus}
\label{sec:org1d8a0ab}

:TODO:
\end{document}
